{"content_length": 3446, "impression": 148725, "target_country": "", "topic256": {"116": 0.18219195306301117, "6": 0.07331480830907822, "218": 0.04844003915786743, "185": 0.045294951647520065, "109": 0.061163339763879776, "111": 0.09979071468114853, "228": 0.02442301996052265, "128": 0.10001944750547409, "100": 0.0276824738830328, "139": 0.05132779851555824}, "word_count": 1524, "ttl": 1550456805, "keywords": {"napalm girl": 0, "vietnam war": 2, "kim phuc": 1, "scar": 4, "vietnames": 3}, "summary_length": 0, "content": "South Vietnamese forces follow after terrified children, including 9-year-old Kim Phuc, center, as they run down Route 1 near Trang Bang after an aerial napalm attack on suspected Viet Cong hiding places on June 8, 1972. A South Vietnamese plane accidentally dropped its flaming napalm on South Vietnamese troops and civilians. The terrified girl had ripped off her burning clothes while fleeing. The children from left to right are: Phan Thanh Tam (the younger brother of Kim Phuc), Phan Thanh Phouc, (the youngest brother of Kim Phuc), Kim Phuc, and Kim's cousins Ho Van Bon and Ho Thi Ting. Behind them are soldiers of the Vietnam Army 25th Division. \nHer picture was one of the most iconic images of the Vietnam War: a girl running naked down a road, screaming in pain after a napalm attack.\nHer name is Kim Phuc, but to many people, she's known as the Napalm Girl. She was only 9 years old when that photograph was taken by The Associated Press photographer Nick Ut, for which he won a Pulitzer Prize. That photo exposed the horrors of the Vietnam War to the world. It also left Phuc bitter and full of hatred. Later, she picked up the Bible and converted to Christianity.\nToday, she lives in Toronto with her family and helps other children victims of war around the world. In between her trips, she shared her story with The World. \nThe World: First, describe that day — June 8, 1972. What were you doing before that picture was taken and what happened next? \nKim Phuc: We were allowed to play inside of the temple nearby the bomb shelter. I remember after lunch, we heard the noise of some burning outside ... suddenly, the soldiers asked the children to run out of the temple.\nI saw the planes were very fast, very loud. As a child, I didn't know anything. And I turned my head. I saw four bombs landing ... then suddenly, the fire was everywhere around me. I didn't see anybody else. And then the fire burned off my clothes, and I saw the fire on my left arm. I used my right hand to wrap it up. That's why my right hand got burned, as well.\nYou just put the fire out with your hand?\nYes. That moment, I was terrified, you know. Then, I ran out of that fire, and I saw my brothers and my cousins and some soldiers with us, probably South Vietnamese soldiers who protected us in the temple. Then, we kept running and running and running, until I was too tired to run anymore. And I saw a lot of people. They stood on the street, and I cried out, \"Too hot, too hot.\" And I remember one of the soldiers; he gave me some water to drink. He poured water over my skin. At that moment, I passed out. I didn't remember anything. I lost consciousness that day. \nAfter you lost consciousness, do you remember the following week? What happened afterward?\nOh, for a long time, I had no idea when my memory came back.\nAfter I got burned, I had a dream. I really wanted to become a doctor. Then, I got into medical school but then, at that moment, the Vietnamese government rediscovered me. I was that little girl in a famous picture, right? So, many foreign journalists came to Vietnam, and they wanted to interview me. So, because of that reason, I was put out of my school to basically do publicity.\nAnd that was a really low point in my life. I didn't have any freedom to do whatever I wanted.\nThe Vietnamese government sent me to Cuba to study for six years. Then, I married a Vietnamese student who I met in my university. On the way back to Cuba [for our honeymoon to Moscow], our airplane had to stop in in Gander, Newfoundland [Newfoundland and Labrador] in Canada, for refueling. So, for one hour in that location, I took my chance; my husband and I defected. Then our life set up in Toronto. We had freedom in Canada. \nAre you are you still haunted by that moment of the attack? How have you battled the psychological pain?\nHonestly, that takes me a while. I was in so much emotional pain. I went through so much of a nightmare. I was so scared. And I thought with this scar on my body, \"When I'm grown up, I'll never have a boyfriend.\" I never thought anybody would marry me even though I can have a normal life, like everyone else.\nThat was in my thoughts all day and it was not easy. In the beginning, I was so disabled. My neck, my arm, my hands. It was so ugly. I was not a child anymore. It was not like I was 9 years old but like I'm 19 years old and I just had so many questions at that time: \"Why me? Why am I still alive? What the purpose for my life?\" And my life is so dark. No hope, no joy, no future.\nAt some point, that changed. What you went through ended up forming a lot of your life and your work. For example, you work these days to help other child victims of war.\nI really wanted to tell all the children who suffer like me, \"Please have a dream. Keep your dream alive just like that little girl.\"\nI shared it with my friends.\nSo, they helped me to establish the Kim Foundation International. Through that foundation, I want to help children who were victims of war, who are underprivileged. And I just dedicated my life to help others. I want to give back; any kind of tragedy that comes to their life, I have been there.\nPhotojournalist Nick Ut and Kim Phuc Phan Thi pose for pictures at the 40th Anniversary Tribute Dinner in Honour of Kim Phuc Phan Thi in Toronto, June 8, 2012. In 1972, Ut took the iconic Vietnam War photograph of a naked Kim Phuc running down a road after being burned in a napalm bomb attack near Trang Bang. \nWhat goes through your own mind when you hear those other stories? Does it help you in your own recovery or does it retraumatize you?\nBoth. You know, I went to Uganda, and it was a big challenge for me to get back to the burn unit. All the bad memories come back to me. ... But I said, \"Kim, that's why you're here. You need to reach out to help people.\" \nAnd then finally, I get in ... I met a child who's 3 years old. His mother just stayed near his bed. I really love that little boy. And then another lady I went to visit — she just had no hope, and she really wanted to die. She didn't want to eat. But then I had an opportunity to give her my picture. And I said to her, \"I got burned so badly like you and I was just 9 years old.\" And she just listened as I shared with her about my pain — my thoughts; I wanted to die; I didn't want to live anymore. \"But now, I'm here. And you have to accept it, and can I pray for you?\"\nAnd she didn't change anything but when I left the burn unit, the nurse told me, \"Wow, you were a big impact on her life. After you left, she stood up, walking in the hallway, and she wanted to eat. She wants to live.\"\nYou have such an optimistic view of how things can proceed in life after you went through so much. Are you ever angry?\nRight now, no. But before, yes. Before I held the hatred for a while. And I learned to forgive. I learned to love my enemies. That is from learning. I'm not born with that. I was raised in a different religion. I was raised in a Cao Dai religion in Vietnam but I was missing something. And I just wondered, \"Where are you, God?\" But then finally I went to the library, and I had read so many religious books and among that, I read the Bible. Then I changed my attitude, changed my behavior.\nI love my scars.\nAnd because of that picture, I got the best treatment later on. I went through 16 operations but unfortunately, I still have a lot of pain, so recently, I went through 10 laser treatments in order to help ease my pain.\nI know you've got kids and grandkids. Have they ever seen the famous photo that was taken of you after that napalm fire? Do they see your scars and want to know why? What do you tell them to keep them positive about humanity?\nThey know my suffering. They know everything. I cannot, you know, hide anything from them. I continue to teach them why Mommy got that scar and pain and suffering. But then I tell them because I still have a life and I still have you ... be thankful to be alive. And I never, never take it for granted ... I count what I have but I'm not thinking about what I lost.\n", "title": "How the Vietnam War's Napalm Girl found hope after tragedy", "max_disgusting_scores": {"20170703": 0.08809182619665719}, "cdn_pictures": null, "location": "ke,tz,za,gh,ng,us", "title_keywords": {"napalm girl": 0, "vietnam war": 1, "tragedi": 2, "hope": 3}, "no_of_pictures": 2, "push_source": "", "timestamp": "2018-02-22T00:15:00Z", "negative_feedback_category": null, "mannual_keywords": false, "hub_timestamp": "2018-02-23T02:26:41Z", "nlp_timestamp": "2018-02-23T02:26:44Z", "no_of_videos": 0, "expiration_timestamp": 0, "summary": "South Vietnamese forces follow after terrified children, including 9-year-old Kim Phuc, center, as they run down Route 1 near Trang Bang after an aerial napalm attack on suspected Viet Cong hiding places on June 8, 1972. A South Vietnamese plane accidentally dropped its flaming napalm on South Vietnamese troops and civilians. The terrified girl had ripped off her burning clothes while fleeing. The children from left to right are: Phan Thanh Tam (the younger brother of Kim Phuc), Phan Thanh Phouc, (the young", "disgusting_scores": {"20170703": [0.08809182619665719, 0.004315004856066056]}, "crawler": "TWITTER_HOME_CRAWLER", "domain": "pri.org", "sub_category": "", "sex": 0, "sanitized_html_length": 0, "key_entities": {"I-LOC Toronto": 3, "I-PER Kim Phuc": 9, "I-LOC Trang": 2, "I-PER Nick Ut": 2, "I-LOC Vietnam": 14}, "images": null, "exp_scores": {"20170830": 0.062214685044289585}, "enter_timestamp": "2018-02-23T02:26:45Z", "click": 6201, "category": "Prose", "body_addons": [], "like_surprises": null, "enter_type": "crawler_news", "sub_sub_category": "", "combined_score": 0, "supervised_keywords_v2": {"kim phuc": 3.3385770320892334}, "score": 0, "thumbnail": {"id": "", "image_server": ""}, "hit_domain_blacklist": false, "evergreen_confidence": 0.8904627886576696, "like_sads": null, "image_mscv_scores": [], "dup_flag": true, "language": "en", "country": "ng", "category_v2_cross": "Art&Design@News_Entertainment_lh", "image_nsfw_scores": [0.01551378145813942, 0.00010330612713005394], "keywords_v2": {"napalm girl": 0.6350680269394742, "vietnam war": 0.35762972120646747, "phan thanh tam": 0.2640515872040657, "kim phuc": 0.9584582043727731, "south vietnames": 0.2865636341273904}, "relevant_entity": [{"stem_format": "napalm girl", "origin_format": "", "weight": 0}, {"stem_format": "kim phuc", "origin_format": "", "weight": 1}, {"stem_format": "vietnam war", "origin_format": "", "weight": 2}], "likes": null, "quality": 0, "sensitive_keywords": 0, "index_type": 1, "head_addons": [], "title_spam_word_count": 0, "quality_entity_original_format": null, "supervised_keywords_v2_origin": {"9-year-old Kim Phuc": 3.3385770320892334}, "domain_category_level": 2, "like_likes": null, "negative_feedback_keyword": null, "list_title": "", "topic2048": {"568": 0.031295716762542725, "1210": 0.06556703895330429, "1563": 0.02278432995080948, "1968": 0.06215796619653702, "1714": 0.020323477685451508, "1825": 0.01793035678565502, "710": 0.01881084404885769, "928": 0.017343362793326378, "20": 0.023190708830952644, "1570": 0.07103057950735092}, "like_angries": null, "low_taste_keywords": 0, "news_id": "88b818a00ea7d27f43a01f812affba5b_ng", "category_v2_score": {"News_Sports": 0.007048394269020917, "Crime": 0.012223406482720633, "Religion": 0.008522418278193793, "Health": 0.02000074505201362, "Art&Design": 0.49940602773426024, "Fashion&Beauty": 0.018690245240958477, "Gaming": 0.005886709015010923, "Business": 0.004471848080023216, "Food": 0.012623988167720195, "Auto": 0.004346250288389195, "Home&Garden": 0.014635250822891695, "Travel": 0.0314842516072258, "Others_Plane_Crash": 0.01390567853708704, "News_Entertainment": 0.19653488558509116, "Accident": 0.014211017505360172, "Others_Natural_Disaster": 0.006473884108501818, "Science": 0.007080636438946193, "Pet_Animals": 0.005544035527927637, "Others_Terrorism": 0.006060441212400202, "News_Politics": 0.052491488171883316, "Prose": 0.02528365725537414, "Education": 0.01354403199550397, "Technology": 0.01953070862349564}, "gallery_type": 0, "topic_v2": {"120": 0.05297399312257767, "101": 0.18894357979297638, "87": 0.10982853174209595}, "quality_entity": [{"stem_format": "napalm girl", "origin_format": "", "weight": 0}, {"stem_format": "kim phuc", "origin_format": "", "weight": 1}, {"stem_format": "vietnam war", "origin_format": "", "weight": 2}], "source_location": "", "amp_url": "https://www.pri.org/stories/2018-02-21/how-vietnam-wars-napalm-girl-found-hope-after-tragedy?amp", "dislikes": 0, "topic": {"882": 0.022865822538733482, "212": 0.025002574548125267, "66": 0.03491401672363281, "260": 0.10359901189804077, "179": 0.0963134616613388, "129": 0.08416228741407394, "138": 0.021604366600513458, "815": 0.03084646351635456, "658": 0.022093502804636955, "538": 0.05092678591609001}, "seed": "", "entry_id": "7e6b4e82_ng", "anti_spam_processed_time": "2018-02-23T02:26:44Z", "id": "88b818a00ea7d27f43a01f812affba5b_ng", "soure_num": 1, "spam_word_count": 5, "top_domain": "pri.org", "imageserver": "http://img.transcoder.opera.com/assets/v1", "author": "", "topic64": {"38": 0.034352850168943405, "59": 0.18304254114627838, "58": 0.020019542425870895, "18": 0.17692071199417114, "44": 0.03155682608485222, "56": 0.019813518971204758, "41": 0.06460878998041153, "3": 0.015575333498418331, "32": 0.0165171530097723, "9": 0.39763012528419495}, "hot": -1, "first_occurrence_timestamp": "2018-02-22T00:25:21Z", "not_interesteds": null, "evergreen": 0, "supervised_keywords": {"napalm girl": 0.6897441030980528, "vietnam war": 0.9009746606282164, "kim phuc": 0.5304647222304248, "south vietnames": 0.6274915146745936, "terrifi": 0.3785454849166539}, "like_laughs": null, "spelling_errors": 0, "gallery_pictures_num": false, "url": "https://www.pri.org/stories/2018-02-21/how-vietnam-wars-napalm-girl-found-hope-after-tragedy?platform=hootsuite", "original_url": "https://www.pri.org/stories/2018-02-21/how-vietnam-wars-napalm-girl-found-hope-after-tragedy?platform=hootsuite"}